In [20]:
import pandas as pd

In [21]:
Car_price = pd.read_csv("C:\\Users\\debra\\OneDrive\\Desktop\\PROJECTS FOR DATAANALYSIS\\DATASETS\\Car_price_prediction\\Cars.csv")

In [22]:
## looking at first 10 rows of the dataset to get an idea of what needs to be cleaned
Car_price.head(10)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Colour,Seats,No. of Doors,New_Price,Price
0,Mahindra Scorpio,Pune,2012.0,99000.0,Diesel,Manual,Third,12.05 kmpl,2179 CC,120 bhp,Black/Silver,8.0,5.0,NaN,6.00
1,Maruti Baleno,Kochi,2018.0,18678.0,Petrol,Manual,First,21.1 kmpl,998 CC,100 bhp,Others,5.0,4.0,NaN,8.32
2,Mahindra Xylo,Bangalore,2013.0,197000.0,Diesel,Manual,First,11.68 kmpl,2498 CC,112 bhp,White,7.0,5.0,NaN,4.00
3,Hyundai Grand,Delhi,2014.0,45000.0,Diesel,Manual,First,24.0 kmpl,1120 CC,70 bhp,White,5.0,4.0,NaN,3.49
4,Toyota Innova,Delhi,2011.0,65000.0,Diesel,Manual,First,12.8 kmpl,2494 CC,102 bhp,Others,8.0,5.0,NaN,6.40
5,Honda WRV,Kochi,2018.0,15135.0,Petrol,Manual,First,17.5 kmpl,1199 CC,88.7 bhp,White,5.0,4.0,10.57 Lakh,9.29
6,Hyundai Verna,Bangalore,2016.0,79000.0,Diesel,Manual,First,24.8 kmpl,1396 CC,88.7 bhp,White,5.0,4.0,NaN,7.25
7,Toyota Fortuner,Pune,2015.0,36000.0,Diesel,Automatic,First,12.55 kmpl,2982 CC,168.5 bhp,White,7.0,5.0,NaN,22.00
8,Toyota Innova,Hyderabad,2009.0,156056.0,Diesel,Manual,First,12.8 kmpl,2494 CC,102 bhp,Others,8.0,5.0,NaN,8.50
9,Chevrolet Beat,Hyderabad,2012.0,61250.0,Diesel,Manual,First,25.44 kmpl,936 CC,57.6 bhp,Others,5.0,4.0,NaN,2.70

In [23]:
## to see the datatypes and no of non null values in each columns
Car_price.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5961 entries, 0 to 5960
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               5961 non-null   object
 1   Location           5950 non-null   object
 2   Year               5959 non-null   float64
 3   Kilometers_Driven  5953 non-null   float64
 4   Fuel_Type          5961 non-null   object
 5   Transmission       5934 non-null   object
 6   Owner_Type         5946 non-null   object
 7   Mileage            5959 non-null   object
 8   Engine             5944 non-null   object
 9   Power              5929 non-null   object
 10  Colour             5950 non-null   object
 11  Seats              5956 non-null   float64
 12  No. of Doors       5960 non-null   float64
 13  New_Price          824 non-null    object
 14  Price              5961 non-null   float64
dtypes: float64(5), object(10)
memory usage: 698.7+ KB

In [24]:
## to get an idea about the distribution of the data within column with numeric data
Car_price.describe()

              Year  Kilometers_Driven        Seats  No. of Doors        Price
count  5959.000000       5.953000e+03  5956.000000   5960.000000  5961.000000
mean   2013.389159       5.871110e+04     5.269140      4.114933     9.528103
std       3.243051       9.171221e+04     0.789048      0.344757    11.214382
min    1998.000000       1.710000e+02     2.000000      2.000000     0.440000
25%    2011.500000       3.393100e+04     5.000000      4.000000     3.500000
50%    2014.000000       5.300000e+04     5.000000      4.000000     5.660000
75%    2016.000000       7.300000e+04     5.000000      4.000000    10.000000
max    2019.000000       6.500000e+06    10.000000      5.000000   160.000000

In [25]:
## Finding null or nan values
Car_price.isna().sum()

Name                    0
Location               11
Year                    2
Kilometers_Driven       8
Fuel_Type               0
Transmission           27
Owner_Type             15
Mileage                 2
Engine                 17
Power                  32
Colour                 11
Seats                   5
No. of Doors            1
New_Price            5137
Price                   0
dtype: int64

In [26]:
# Total no of rows and columns befoe we eliminate the null values
Car_price.shape

(5961, 15)

In [27]:
## the entire operation of dropping na values using for loop

for column in ['Location','Seats','No. of Doors','Colour','Power','Engine','Mileage','Owner_Type',
                         'Transmission','Year']:
    Car_price=Car_price.dropna(subset=[column])
Car_price.shape

(5889, 15)

In [28]:
## after removing null values from the column we are left with only 5889 rows and 15 columns

In [29]:
## it can also be done with the help of this function

def dropnacolumn(df, columns):
    for column in columns:
        df=df.dropna(subset=[column])
    return df.shape

In [30]:
dropnacolumn(df=Car_price,columns=['Location','Seats','No. of Doors','Colour','Power','Engine','Mileage','Owner_Type',
                         'Transmission','Year'])

(5889, 15)

In [31]:
## Dropping the New_Price column as it has too many na values

Car_price.drop(columns = 'New_Price', inplace = True)

In [32]:
#Converting Mileage column values into numeric in order to be able to do data analysis
Car_price['Mileage'] = Car_price['Mileage'].str.replace('kmpl|km/kg','',regex=True)
Car_price['Mileage']=Car_price['Mileage'].astype(float)

In [33]:
#Converting Engine column values into numeric 
Car_price['Engine'] = Car_price['Engine'].str.replace('CC','')
Car_price['Engine']=Car_price['Engine'].astype(int)

In [34]:
#Converting Power column values into numeric 
Car_price['Power'] = Car_price['Power'].str.replace('bhp','')

## Dropping specific rows with 'null ' as a value in thier Power column
Car_price.drop(Car_price[Car_price['Power']== 'null '].index,inplace=True)

Car_price['Power']=Car_price['Power'].astype(float)

In [17]:
## Checking data distribution of the newly added numeric column
Car_price.describe()

,Year,Kilometers_Driven,Mileage,Engine,Power,Seats,No. of Doors,Price
count,5786.000000,5.786000e+03,5786.000000,5786.000000,5786.000000,5786.000000,5786.000000,5786.000000
mean,2013.488593,5.833314e+04,18.278629,1626.677325,113.433716,5.274628,4.118044,9.641153
std,3.163255,9.277115e+04,4.361078,601.763872,53.892306,0.788050,0.342944,11.292628
min,1998.000000,1.710000e+02,0.000000,624.000000,34.200000,2.000000,2.000000,0.440000
25%,2012.000000,3.325675e+04,15.260000,1198.000000,75.235000,5.000000,4.000000,3.550000
50%,2014.000000,5.253450e+04,18.240000,1496.000000,98.590000,5.000000,4.000000,5.750000
75%,2016.000000,7.246800e+04,21.100000,1991.000000,138.100000,5.000000,4.000000,10.110000
max,2019.000000,6.500000e+06,33.540000,5998.000000,560.000000,10.000000,5.000000,160.000000

In [19]:
Car_price

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Colour,Seats,No. of Doors,Price
0,Mahindra Scorpio,Pune,2012.0,99000.0,Diesel,Manual,Third,12.05,2179,120.0,Black/Silver,8.0,5.0,6.00
1,Maruti Baleno,Kochi,2018.0,18678.0,Petrol,Manual,First,21.10,998,100.0,Others,5.0,4.0,8.32
2,Mahindra Xylo,Bangalore,2013.0,197000.0,Diesel,Manual,First,11.68,2498,112.0,White,7.0,5.0,4.00
3,Hyundai Grand,Delhi,2014.0,45000.0,Diesel,Manual,First,24.00,1120,70.0,White,5.0,4.0,3.49
4,Toyota Innova,Delhi,2011.0,65000.0,Diesel,Manual,First,12.80,2494,102.0,Others,8.0,5.0,6.40
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5956,Honda Civic,Pune,2011.0,47000.0,Petrol,Automatic,Second,13.90,1799,130.3,Others,5.0,4.0,4.50
5957,Hyundai i20,Delhi,2013.0,63777.0,Petrol,Manual,First,18.50,1197,82.9,Black/Silver,5.0,4.0,3.67
5958,Maruti Swift,Coimbatore,2016.0,37806.0,Petrol,Manual,First,20.40,1197,81.8,Black/Silver,5.0,4.0,5.20
5959,Mercedes-Benz SLK-Class,Coimbatore,2016.0,22732.0,Petrol,Automatic,First,18.10,3498,306.0,Black/Silver,2.0,2.0,55.54
5960,Hyundai i10,Kolkata,2016.0,7000.0,Petrol,Manual,First,20.36,1197,78.9,White,5.0,4.0,3.60

In [ ]:
#Saving the cleaned dataset
Car_price.to_csv(r'C:\\Users\\debra\\OneDrive\\Desktop\\PROJECTS FOR DATAANALYSIS\\DATASETS\\Car_price_prediction\\Car_price_prediction_cleaned.csv',index = False)